balazsgrill/modembed/res/Devices/dsPIC33/PIC24EP256GU810.PIC
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="24"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="CSCK"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="CSDI"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="25"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="COFS"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="26"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="C2RX"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="C1RX"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="27"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U3CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U3RX"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="28"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="U4CTS"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="U4RX"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="29"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SCK3"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SDI3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="30"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SS3"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="31"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SCK4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SDI4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="32"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SS4"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="33"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC10"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC9"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="34"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC12"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC11"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="35"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC14"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC13"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="36"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="IC16"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="IC15"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="37"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="FLT5"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="OCFC"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="38"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="FLT7"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="FLT6"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="40"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="DTCMP2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="DTCMP1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="41"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="DTCMP4"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="DTCMP3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="42"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="DTCMP6"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="DTCMP5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="43"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="RSV"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="DTCMP7"/>
          <edc:ModuleExclude edc:impl="0x80ff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01017-RPINRx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="45"/>
          <edc:ModuleMacro edc:replace="%x%" edc:with="SYNCI2"/>
          <edc:ModuleMacro edc:replace="%y%" edc:with="SYNCI1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="44"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00892.Module"/>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-00804.Module">
          <edc:ModuleExclude edc:impl="0xdbff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00826.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0xc" edc:end="0xe" edc:modsrc="DOS-00826.Module"/>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0xe" edc:end="0x12" edc:modsrc="DOS-00826.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-01017-PMDx.Module">
          <edc:ModuleExclude edc:impl="0xffdb" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xffe9" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0xff" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0xfffe" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0xfbff" edc:offset="0x0"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="146"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xC" edc:modsrc="DOS-00927.Module">
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0xf5ff" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x3fff" edc:offset="0xa"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0xD" edc:end="0x12" edc:modsrc="DOS-00927.Module"/>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:Module_ref edc:begin="0x20" edc:end="0x2C" edc:modsrc="DOS-00927.Module">
          <edc:ModuleExclude edc:impl="0xf5ff" edc:offset="0x28"/>
          <edc:ModuleExclude edc:impl="0x3fff" edc:offset="0x2a"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x26"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x2E" edc:end="0x32" edc:modsrc="DOS-00927.Module"/>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:Module_ref edc:begin="0x40" edc:end="0x64" edc:modsrc="DOS-00927.Module">
          <edc:ModuleExclude edc:impl="0xf88f" edc:offset="0x5c"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:Module_ref edc:begin="0x68" edc:end="0x70" edc:modsrc="DOS-00927.Module">
          <edc:ModuleExclude edc:impl="0x88ff" edc:offset="0x6e"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:Module_ref edc:begin="0x7a" edc:end="0x88" edc:modsrc="DOS-00927.Module"/>
        <edc:AdjustPoint edc:offset="56"/>
        <edc:Module_ref edc:begin="0xc0" edc:end="0xca" edc:modsrc="DOS-00927.Module"/>
        <edc:AdjustPoint edc:offset="54"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="10"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="12"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="13"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="14"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xa" edc:modsrc="DOS-00933.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="16"/>
          <edc:ModuleExclude edc:impl="0xf9ff" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="224"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="100"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="5"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="6"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="7"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="9"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="10"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="11"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="12"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="13"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="14"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x10" edc:end="0x1c" edc:modsrc="DOS-00929.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="15"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="516"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="A"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xc03f" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0xc6ff" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x6c0" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="B"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="B"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="C"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="C"/>
          <edc:ModuleExclude edc:impl="0x601e" edc:offset="0xe"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0xf01e" edc:offset="0x8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="D"/>
          <edc:ModuleExclude edc:impl="0xff3f" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0xc0" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="E"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x8" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="E"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0xe"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x3ff" edc:offset="0x8"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0xe" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="F"/>
          <edc:ModuleExclude edc:impl="0x313f" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0x313f" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0x313f" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0x313f" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0x313f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x313f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x313f" edc:offset="0xc"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x10" edc:modsrc="DOS-01117-PORTx.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="G"/>
          <edc:ModuleExclude edc:impl="0xf3c3" edc:offset="0x0"/>
          <edc:ModuleExclude edc:impl="0xf3cf" edc:offset="0x2"/>
          <edc:ModuleExclude edc:impl="0xf3c3" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xf003" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0xf3cf" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0xf3c3" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0xf3c3" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x3c0" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="142"/>
        <edc:SFRDef edc:access="--------------nn" edc:cname="PADCFG1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------xx" edc:name="PADCFG1" edc:nzwidth="16" edc:por="--------------xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMPTTL" edc:desc="" edc:mask="0x1" edc:name="PMPTTL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x80"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="FEXL" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="FEXL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="FEXL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="FEXU" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="FEXU" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXU" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="FEXU" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
